{"config": [{"config": {"strides": [1, 1], "trainable": true, "filters": 32, "padding": "valid", "name": "conv2d_1", "data_format": "channels_last", "batch_input_shape": [null, 70, 70, 3], "kernel_size": [3, 3], "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "trainable": true, "filters": 32, "padding": "valid", "name": "conv2d_2", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "trainable": true, "filters": 64, "padding": "valid", "name": "conv2d_3", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "padding": "valid", "name": "max_pooling2d_3", "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "trainable": true, "units": 128, "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "trainable": true, "units": 7, "name": "dense_2", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.0.8", "class_name": "Sequential"}