{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "border_mode": "valid", "nb_filter": 32, "dim_ordering": "tf", "activation": "linear", "input_dtype": "float32", "W_regularizer": null, "batch_input_shape": [null, 70, 70, 3], "trainable": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_row": 3}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "border_mode": "valid", "nb_filter": 32, "dim_ordering": "tf", "activation": "linear", "W_regularizer": null, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_row": 3}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "border_mode": "valid", "nb_filter": 64, "dim_ordering": "tf", "activation": "linear", "W_regularizer": null, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_row": 3}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.25, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "output_dim": 128, "b_constraint": null, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "input_dim": 3136, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "output_dim": 7, "b_constraint": null, "trainable": true, "b_regularizer": null, "activity_regularizer": null, "input_dim": 128, "W_constraint": null, "activation": "linear", "init": "glorot_uniform", "W_regularizer": null, "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "softmax", "trainable": true}}], "keras_version": "1.2.2"}